app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    # Get all the articles and show them

    # 1. Get all the articles
    @articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    # @article_id = params[:id]

    #
    @article = Article.find params[:id]